       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. XXX-ZOS.
       OBJECT-COMPUTER. XXX-ZOS.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT FILEN ASSIGN TO DDNAME
       ORGANIZATION IS SEQUENTIAL.
